#include <iostream>


//~ Приклад використання посилання на змінну

using std::cout, std::endl;

//~ Функція, що отримує як аргумент посилання
void square(int& var)
{
	var *= var;
}

int main()
{
	int a = 3;

	//~ Приклад оголошення посилання і використання в одній функції.
	//~ int & b = a;

	//~ cout <<  "b = " << b << endl;

	//~ b = b / 3;
	//~ cout <<  "a = " << a << endl;

	//~ Передавання змінної у функцію (буде передано за адресою - "a" зміниться)
	square(a);
	cout <<  "a = " << a << endl;
	
	return 0;
}
