#include "vector.hpp"

//~ Праграма первірки первантажених операторів класу Vector

int main()
{ 
	//~ Виклик статичної функції класу - можна викликати буз створення об'єкту
	Vector::max_vector();

	//~ Створення вектору
	Vector v_1{2.0, 3.0, 4.0};

	//~ Додавання рядка до вектора - буде використаний перевантажений оператор
	string v_name = "force";
	v_1 =  v_1 + v_name;

	//~ Присвоєння одного вектора іншому - буде викликаний конструктор копіювання
	Vector v_2 = v_1;

	//~ Додавання двох векторів - буде використаний перевантажений оператор
	Vector v_3 = v_1 + v_2;

	//~ Друкування векторів  - буде використаний перевантажений оператор
	cout << "v_1: " << v_1;
	cout << "v_2: " << v_2;
	cout << "v_3: " << v_3;

	//~ Звернення до статичного поля класу - тут це лічильниук створених векторів
	cout << "Vectors produced:\t" <<  Vector::counter << endl;

	return 0;
}
